WildernessLabs/Meadow/nuttx/configs/stm32f777zit6-meadow/src/meadow_adc.c
    regval |= ADC_CR2_DMA;
    putreg32(regval, STM32_ADC1_BASE + STM32_ADC_CR2_OFFSET);

    // Wakeup callers thread
    sem_post(&_waitTillDoneSem);
  }
}

//==========================================================================
// ADC conversion ISR
static int adc_conversion_interrupt_handler_isr(int irq, FAR void *context,
            FAR void *arg)
{
  // The interrupt conversion can be programmed to be called for the following
  // Discription                          Event Flag    Enable control bit
  // -----------                          ----------    ------------------
  // End of conversion of a regular group     EOC             EOCIE
  // End of conversion of an injected group   JEOC            JEOCIE
  // Analog watchdog status bit is set        AWD             AWDIE
  // Overrun                                  OVR             OVRIE
  uint32_t pendingInterrupts;
  uint32_t baseADCAddr = (uint32_t)arg;

  pendingInterrupts = getreg32(baseADCAddr + STM32_ADC_SR_OFFSET);
  if(pendingInterrupts == 0)
  {
    syslog(1, "-- ADC ISR-NO Interrupts --\n");
    return OK;
  }

#if defined CONFIG_ADC_TESTS
  if ((pendingInterrupts & ADC_SR_AWD) != 0)
  {
    syslog(1, "-- ADC ISR-WatchDog --\n");
  }

  if ((pendingInterrupts & ADC_SR_OVR) != 0)
  {
    syslog(1, "-- ADC ISR-Over Run --\n");

  // Note: Meadow_ADC is ignoring data Overruns
  //
  // From Ref Man 15.8.1 & 15.8.2
  // To recover the ADC from OVR when the DMA is used, follow the steps below:
  // 1. Reinitialize the DMA (adjust destination address and NDTR counter).
  //    This is DMA
  // 2. Clear the ADC OVR bit in ADC_SR register (below)
  //    This is ADC
  // 3. Trigger the ADC to start the conversion (below)
  //    This is ADC
  //
  // Note: #1 above - there doesn't appear to be in NuttX stm32f7/stm32_dma.c
  // code a function to "Reinitialize the DMA".
  // See nuttx/arch/arm/src/stm32f7/stm32_dma.c @657-673 for code that would
  // do the above requirement (I think).
  }

  // End of conversion - got a value?
  if ((pendingInterrupts & ADC_SR_EOC) != 0)
  {
    syslog(1, "-- ADC ISR-End of Conversion --\n");
  }
#endif

  // Clear any interrupts
  pendingInterrupts &= ~ADC_ALL_POSSIBLE_ADC_INTERRUPTS;
  putreg32(pendingInterrupts, baseADCAddr + STM32_ADC_SR_OFFSET);

  return OK;
}

//==========================================================================
static void meadow_adc_buffer_takesem(sem_t *semaphore)
{
  int ret;
  do
  {
    ret = sem_wait(semaphore);
  }
  while (ret == -EINTR);
}

//==========================================================================
// Find ADC input channel (0-16) from the provided GPIO input port/pin
static int get_in_chan_from_pinid(uint32_t pinId, uint32_t *adcInputChan)
{
  int mapOff;

  // Look for match
  for(mapOff = 0; mapOff < MEADOW_ADC_GPIO_CHAN_MAP_LENGTH; mapOff++)
  {
    if(pinId == _gpioAdcChanMap[mapOff])
    {
      *adcInputChan = mapOff;
      return OK;
    }
  }

  // Return error since no GPIO matched any valid analog input GPIOs
  return -EBADSLT;    // 55 - Invalid Slot
}

//======================================================================
// Helps fill the sequence registers
static int populate_adc_seq_channel(uint32_t *regval, uint32_t seqRegMaxGpios,
          uint32_t initRegShift)
{
  int ret;
  uint32_t regCnt;
  uint32_t adcInputChan;

  // Cycle through all the slots in this register
  for(regCnt = 0; regCnt < seqRegMaxGpios; regCnt++)
  {
    // For entry x what 'ADC input' channel
    ret = get_in_chan_from_pinid(_gpioList[regCnt], &adcInputChan);
    if(ret < 0)
      return ret;    // Error

    *regval |= (adcInputChan << (initRegShift + (regCnt * 5)));
  }
  return OK;
}

//======================================================================
// Using injection for temp and vbat
int meadow_adc_read_internal_temp_vref(uint16_t *rawTempMeasurement)
{
  uint32_t regval;
  uint16_t regval16;

  // We need adc_initialize to have been called.
  if(! _meadowAdcInit)
  {
    syslog(LOG_ERR, "%s@%d-Error:Meadow ADC not initialized.\n",
              __FILE__, __LINE__);
    return -EPERM;    // Operation not permitted
  }

  // Testing - read the data registers before conversion
  // syslog(1, "Read JDR1:%u, JDR2:%u\n",
  //           getreg32(STM32_ADC1_BASE + STM32_ADC_JDR1_OFFSET),
  //           getreg32(STM32_ADC1_BASE + STM32_ADC_JDR2_OFFSET));
  // usleep(20 * 1000);
  
  // Injection Sequence Register - set ADC input at 18 since ADC_IN18 is used
  // by temperature and vbat depending on eht value of TSVREFE
  regval = getreg32(STM32_ADC1_BASE + STM32_ADC_JSQR_OFFSET);
  regval &= 0x003fffff;   // Clear all JSQR Bits
  regval |= 18;           // ADC_IN18 - Vsense (temp  or vbat)
  regval |= 17;           // ADC_IN17 - Vrefint
  // And set the length to indicate 2 analog inputs
  regval |= (1 << ADC_JSQR_JL_SHIFT);
  putreg32(regval, STM32_ADC1_BASE + STM32_ADC_JSQR_OFFSET);

  // CCR
  regval = getreg32(STM32_ADC_CCR);
  regval |= ADC_CCR_TSVREFE;        // 1=enable temperature sensor and reference
  regval &= ~ADC_CCR_VBATE;         // 0=disable vbat channel
  putreg32(regval, STM32_ADC_CCR);

  // ADC Control Register 2 (CR2) - Start the ADC
  regval = getreg32(STM32_ADC1_BASE + STM32_ADC_CR2_OFFSET);
  regval |= ADC_CR2_JSWSTART;       // Start injection ADC
  putreg32(regval, STM32_ADC1_BASE + STM32_ADC_CR2_OFFSET);

  usleep(5 * 1000);    // Wait till next tick

  // Get the Vsense (temperature) and Vrefint
  regval16 = getreg32(STM32_ADC1_BASE + STM32_ADC_JDR1_OFFSET);
  if(rawTempMeasurement != NULL)
    *rawTempMeasurement = regval16;
  
  // The internal reference voltage is saved for all ADC calculations
  regval16 = getreg32(STM32_ADC1_BASE + STM32_ADC_JDR2_OFFSET);
  _Vrefint = regval16;

  return OK;
}

//======================================================================
// 
int meadow_adc_read_internal_vbat(uint16_t *rawBatteryMeasurement)
{
  uint32_t regval;
  uint16_t regval16;

  // Injection Sequence Register - set ADC input at 18 since ADC_IN18 is used
  // by vbat
  regval = getreg32(STM32_ADC1_BASE + STM32_ADC_JSQR_OFFSET);
  regval &= 0x003fffff;   // Clear all JSQR Bits
  regval |= 18;           // ADC_IN18 - Vbat
  // And set the length to indicate 1 input
  regval |= (0 << ADC_JSQR_JL_SHIFT);
  putreg32(regval, STM32_ADC1_BASE + STM32_ADC_JSQR_OFFSET);

  // ADC sampling time reading the temperature is 10usec (data sheet Table 78)
  // Now we can read Vbat
  regval = getreg32(STM32_ADC_CCR);
  regval &= ~ADC_CCR_TSVREFE;     // 0=disable temperature sensor and ref
  regval |= ADC_CCR_VBATE;        // 1=enable vbat channel
  putreg32(regval, STM32_ADC_CCR);

  // ADC Control Register 2 (CR2)
  regval = getreg32(STM32_ADC1_BASE + STM32_ADC_CR2_OFFSET);
  regval |= ADC_CR2_JSWSTART;       // Restart injection ADC
  putreg32(regval, STM32_ADC1_BASE + STM32_ADC_CR2_OFFSET);

  usleep(5 * 1000);    // Wait till next tick

  *rawBatteryMeasurement = getreg16(STM32_ADC1_BASE + STM32_ADC_JDR1_OFFSET);;
  // syslog(1, "Raw values-Vbat:%u\n", *rawBatteryMeasurement);

  return OK;
}

//======================================================================
//
int meadow_adc_read_internal_cleanup(void)
{
  uint32_t regval;

  // Restore register values to neutral
  // Disable both Temperature and Vbat
  regval = getreg32(STM32_ADC_CCR);
  regval &= ~ADC_CCR_TSVREFE;     // 0=disable temperature sensor channel
  regval &= ~ADC_CCR_VBATE;        // 0=disable vbat channel
  putreg32(regval, STM32_ADC_CCR);

