WildernessLabs/Meadow/nuttx/configs/stm32f777zit6-meadow/src/meadow_adc.c
    regval = getreg32(STM32_ADC1_SQR1);
    regval &= ADC_SQR1_RESERVED;   // Clear all SQR Bits
    ret = populate_adc_seq_channel(&regval, seqRegMaxGpios, ADC_SQR1_SQ13_SHIFT);
    if(ret < 0)
      return ret;    // Error
    putreg32(regval, STM32_ADC1_SQR1);
  }

  // Last set the size
  regval = getreg32(STM32_ADC1_SQR1);
  regval |= ((_gpioTransferCount - 1) << ADC_SQR1_L_SHIFT);
  putreg32(regval, STM32_ADC1_SQR1);

  //----------------ADC_CCR_TSVREFE--------------------------------------------
  // ADC Common Control Register (CCR) [Common == for all ADCs]
  regval = getreg32(STM32_ADC_CCR);
#if defined CONFIG_ADC_TESTS        // For testing allow temp sensor & ref
  regval |= ADC_CCR_TSVREFE;        // 1=enable temperature sensor channel
#else
  regval &= ~ADC_CCR_TSVREFE;       // 0=disable temperature sensor channel
#endif
  regval &= ~ADC_CCR_VBATE;         // 0=disable vbat channel
  // ADCPRE - Calculation based on PCLK2=96MHz (with 192MHz clock). Per Data
  // Sheet 5.3.24 pp 165, max ADC clock is 36MHz. Therefore, divide by 4
  // (96/4=24MHz) is the highest freq. For clock details see Meadow's board.h
  regval &= ~ADC_CCR_ADCPRE_MASK;   // Clear any bits in ADC prescaler
  regval |= ADC_CCR_ADCPRE_DIV4;    // 01=ADC prescaler PCLK2 divided by 4

  // DMA access mode for multi ADC mode
  // 00: DMA mode disabled
  // 01: DMA mode 1 enabled (2 / 3 half-words one by one - 1 then 2 then 3)
  // 10: DMA mode 2 enabled (2 / 3 half-words by pairs - 2&1 then 1&3 then 3&2)
  // 11: DMA mode 3 enabled (2 / 3 bytes by pairs - 2&1 then 1&3 then 3&2)
  regval &= ~ADC_CCR_DMA_MASK;      // Clear any bits in DMA mode (multi-ADC mode only) 
  regval |= ADC_CCR_DMA_DISABLED;   // 00 = DMA Modes (multi-ADC mode only)
  regval &= ~ADC_CCR_DDS;           // 0=No new DMA request is issued after the last transfer
  regval &= ~ADC_CCR_DELAY_MASK;    // 0000=5*Tadcclk (only used for dual/triple)
  regval &= ~ADC_CCR_MULTI_MASK;    // Clear any bits
  regval |= ADC_CCR_MULTI_NONE;     // 00000=Independent mode
  putreg32(regval, STM32_ADC_CCR);

  return OK;
}

//================================================================
// Enable ADC
static void adc_enable(void)
{
  uint32_t regval;

  // Set ADON to turn on this ADC
  regval = getreg32(STM32_ADC1_BASE + STM32_ADC_CR2_OFFSET);
  regval |= ADC_CR2_ADON;
  putreg32(regval, STM32_ADC1_BASE + STM32_ADC_CR2_OFFSET);

  // Wait a bit
  usleep(400);
}

//================================================================
// Start ADC
static void adc_start(void)
{
  uint32_t regval;

  // Enable DMA
  regval  = getreg32(STM32_DMA2_S0CR);
  regval |= DMA_SCR_EN;
  putreg32(regval, STM32_DMA2_S0CR);

  // Initiate the ADC conversion
  regval  = getreg32(STM32_ADC1_BASE + STM32_ADC_CR2_OFFSET);
  regval |= ADC_CR2_SWSTART;
  putreg32(regval, STM32_ADC1_BASE + STM32_ADC_CR2_OFFSET);
}

//================================================================
// Initialize DMA
static void dma_initialize(void)
{
  uint32_t regval;

  // Using Nuttx DMA to handle ADC DMA
  _dmaHandle = stm32_dmachannel(DMAMAP_ADC1_1);

  // Configure the DMA SCR (Stream Control Register) values
  regval = getreg32(STM32_DMA2_S0CR);
  regval |=  DMA_SCR_MSIZE_16BITS;  // Size of memory transfer
  regval |= DMA_SCR_PSIZE_16BITS;   // Size of peripheral transfer
  // Memory increment mode. 0=mem addr is fixed, 1=mem addr increments
  regval |= DMA_SCR_MINC;           // Mem Increment
  regval |= DMA_SCR_DIR_P2M;        // Direction 0=Perph->Mem

  // SxNDTR is set by Nuttx
  stm32_dmasetup(_dmaHandle,
                 STM32_ADC1_BASE + STM32_ADC_DR_OFFSET, // Peripheral addr
                 (uint32_t) _dmaDataBuf,    // Destination buffer
                 _gpioTransferCount,        // number to transfers
                 regval);

  // Provides DMA callback information
  // void *arg will be returned via callback to ISR
  // true/false for half buffer callback as well as full buffer.
  // But doesn't seem to honor 'false' 1/2 callbacks are still made
  stm32_dmastart(_dmaHandle, adc_dma_interrupt_handler_isr,
            (void *)STM32_ADC1_BASE, false);
}

//================================================================
// Call all the sub-initialization functions. This function prepares the ADC
// to do analog conversion.
int meadow_adc_initialize_dma(void)
{
  int ret;
  static bool firstTime = true;

#if defined CONFIG_ADC_TESTS
  syslog(1, "Entered meadow_adc_initialize_dma()\n"); usleep(20 * 1000);
#endif

  if(firstTime)
  {
    firstTime = false;
    _dmaHandle = NULL;
    memset(_dmaDataBuf, 0, _adcBufSzBytes);

#if defined CONFIG_ADC_TESTS
    _noChangeCnt = 0;
#endif
  }
  else
  {
    syslog(LOG_WARNING, "Only initialize once\n");
    return -EALREADY;
  }

  // Setup the ADC Interrupt handler
  ret = irq_attach(STM32_IRQ_ADC, adc_conversion_interrupt_handler_isr,
            (void *)STM32_ADC1_BASE);
  if(ret < 0)
  {
    syslog(1, "Error calling irq_attach\n");
    return ret;
  }

  ret = adc_initialize();
  if(ret < 0)
  {
    syslog(1, "Error calling adc_initialize\n"); usleep(20 * 1000);
    return ret;
  }

  dma_initialize();

  adc_enable();

  // Enable ADC interrupt handler
  up_enable_irq(STM32_IRQ_ADC);
  
  _meadowAdcInit = true;
  // ADC + DMA won't start until adc_start() is called

  // We need to establish the Vrefint value for all future ADC reads.
  ret = meadow_adc_read_internal_temp_vref(NULL);
  if(ret < 0)
  {
    syslog(LOG_ERR, "%04d-Temperature Conversion Error. ret:%d\n", ret);
    return ret;
  }

#if defined CONFIG_ADC_TESTS
  syslog(1, "--> Exiting ADC config\n"); usleep(20 * 1000);
#endif

  return OK;
}

/************************************************************************************
 * Public Functions
 ************************************************************************************/
// This function can handle as few as 1 GPIO with 1 buffer element and as many
// as 16 GPIOs with a buffer with space for all 16.
int meadow_adc_configure(uint8_t gpioList[], uint32_t gpioCount,
          uint16_t *userDataBuf, uint32_t adcBufSzBytes)
{
#if defined CONFIG_ADC_TESTS
  syslog(1, "meadow_adc_configure() gpioCount:%lu, adcBufSzBytes:%lu, userDataBuf:%p\n",
            gpioCount, adcBufSzBytes, userDataBuf);
#endif

  // Check for valid and reasonable input parameters
  uint32_t gpioListOff;
  uint32_t mapOff = 0;

  uint32_t userBufElements;
  if(userDataBuf == NULL)
  {
    syslog(1, "%s@%d-Error:userDataBuf is NULL\n",
              __FILE__, __LINE__, adcBufSzBytes);
    return -EINVAL;   // Invalid argument
  }
  
  // Data elements are 2 bytes, therefore, size must be even number
  if(adcBufSzBytes % 2)
  {
    syslog(1, "%s@%d-Error:ADC values are always 16-bits and adcBufSzBytes is not even (%lu)\n",
              __FILE__, __LINE__, adcBufSzBytes);
    return -EINVAL;   // Invalid argument
  }

